In [1]:
import pandas as pd
import json

In [5]:
datos_dicc = [{'ID':1,'Nombre':'Hector', 'edad':20, 'mencion_gaseosa':['Coca-Cola','Colombiana','Pepsi'], 
                  'hobbies':['Musica', 'Correr']},
                {'ID':2,'Nombre':'Carolina', 'edad':40, 'mencion_gaseosa':['Coca-Cola','Manzana Postobón','Sprite'], 
                  'hobbies':'Cine'},
                {'ID':3, 'edad':27, 'mencion_gaseosa':['Coca-Cola','Colombiana','Pepsi'], 
                  'hobbies':['Escribir', 'Viajar']},
                {'ID':4,'Nombre':'Camila', 'edad':18, 'mencion_gaseosa':['Pepsi','Coca-Cola']},
                {'ID':5,'Nombre':'Jose', 'edad':50, 'mencion_gaseosa':['Coca-Cola'], 
                  'hobbies':'Programar'}]

In [20]:
datos=pd.json_normalize(datos_dicc)
datos

,ID,Nombre,edad,mencion_gaseosa,hobbies
0,1,Hector,20,"[Coca-Cola, Colombiana, Pepsi]","[Musica, Correr]"
1,2,Carolina,40,"[Coca-Cola, Manzana Postobón, Sprite]",Cine
2,3,NaN,27,"[Coca-Cola, Colombiana, Pepsi]","[Escribir, Viajar]"
3,4,Camila,18,"[Pepsi, Coca-Cola]",NaN
4,5,Jose,50,[Coca-Cola],Programar

In [15]:
datos.mencion_gaseosa.values.tolist()

[['Coca-Cola', 'Colombiana', 'Pepsi'],
 ['Coca-Cola', 'Manzana Postobón', 'Sprite'],
 ['Coca-Cola', 'Colombiana', 'Pepsi'],
 ['Pepsi', 'Coca-Cola'],
 ['Coca-Cola']]

In [16]:
pd.DataFrame(datos.mencion_gaseosa.values.tolist())

           0                 1       2
0  Coca-Cola        Colombiana   Pepsi
1  Coca-Cola  Manzana Postobón  Sprite
2  Coca-Cola        Colombiana   Pepsi
3      Pepsi         Coca-Cola    None
4  Coca-Cola              None    None

In [27]:
datos=datos.join(pd.DataFrame(datos.mencion_gaseosa.values.tolist()))
datos

,ID,Nombre,edad,mencion_gaseosa,hobbies,Marca1,Marca2,Marca3,0,1,2
0,1,Hector,20,"[Coca-Cola, Colombiana, Pepsi]","[Musica, Correr]",Coca-Cola,Colombiana,Pepsi,Coca-Cola,Colombiana,Pepsi
1,2,Carolina,40,"[Coca-Cola, Manzana Postobón, Sprite]",Cine,Coca-Cola,Manzana Postobón,Sprite,Coca-Cola,Manzana Postobón,Sprite
2,3,NaN,27,"[Coca-Cola, Colombiana, Pepsi]","[Escribir, Viajar]",Coca-Cola,Colombiana,Pepsi,Coca-Cola,Colombiana,Pepsi
3,4,Camila,18,"[Pepsi, Coca-Cola]",NaN,Pepsi,Coca-Cola,None,Pepsi,Coca-Cola,None
4,5,Jose,50,[Coca-Cola],Programar,Coca-Cola,None,None,Coca-Cola,None,None

In [26]:
datos.rename(columns={0:'Marca1', 1:'Marca2',2:'Marca3'}, inplace=True)
datos

,ID,Nombre,edad,mencion_gaseosa,hobbies,Marca1,Marca2,Marca3
0,1,Hector,20,"[Coca-Cola, Colombiana, Pepsi]","[Musica, Correr]",Coca-Cola,Colombiana,Pepsi
1,2,Carolina,40,"[Coca-Cola, Manzana Postobón, Sprite]",Cine,Coca-Cola,Manzana Postobón,Sprite
2,3,NaN,27,"[Coca-Cola, Colombiana, Pepsi]","[Escribir, Viajar]",Coca-Cola,Colombiana,Pepsi
3,4,Camila,18,"[Pepsi, Coca-Cola]",NaN,Pepsi,Coca-Cola,None
4,5,Jose,50,[Coca-Cola],Programar,Coca-Cola,None,None

# Continuación ejemplo

In [62]:
datos_diccA = [{'ID':1,'Nombre':'Hector', 'edad':20, 'mencion_gaseosa':{'marca1':'Coca-Cola','marca2':'Colombiana','marca3':'Pepsi'}, 
                  'hobbies':['Musica', 'Correr']},
                {'ID':2,'Nombre':'Carolina', 'edad':40, 'mencion_gaseosa':{'marca1':'Coca-Cola','marca2':'Manzana Postobón','marca3':'Sprite'}, 
                  'hobbies':'Cine'},
                {'ID':3, 'edad':27, 'mencion_gaseosa':{'marca1':'Coca-Cola','marca2':'Colombiana','marca3':'Pepsi'}, 
                  'hobbies':['Escribir', 'Viajar']},
                {'ID':4,'Nombre':'Camila', 'edad':18, 'mencion_gaseosa':{'marca1':'Pepsi','marca2':'Coca-Cola'}},
                {'ID':5,'Nombre':'Jose', 'edad':50, 'mencion_gaseosa':{'marca1':'Coca-Cola'}, 
                  'hobbies':'Programar'}]
datos_diccA

[{'ID': 1,
  'Nombre': 'Hector',
  'edad': 20,
  'mencion_gaseosa': {'marca1': 'Coca-Cola',
   'marca2': 'Colombiana',
   'marca3': 'Pepsi'},
  'hobbies': ['Musica', 'Correr']},
 {'ID': 2,
  'Nombre': 'Carolina',
  'edad': 40,
  'mencion_gaseosa': {'marca1': 'Coca-Cola',
   'marca2': 'Manzana Postobón',
   'marca3': 'Sprite'},
  'hobbies': 'Cine'},
 {'ID': 3,
  'edad': 27,
  'mencion_gaseosa': {'marca1': 'Coca-Cola',
   'marca2': 'Colombiana',
   'marca3': 'Pepsi'},
  'hobbies': ['Escribir', 'Viajar']},
 {'ID': 4,
  'Nombre': 'Camila',
  'edad': 18,
  'mencion_gaseosa': {'marca1': 'Pepsi', 'marca2': 'Coca-Cola'}},
 {'ID': 5,
  'Nombre': 'Jose',
  'edad': 50,
  'mencion_gaseosa': {'marca1': 'Coca-Cola'},
  'hobbies': 'Programar'}]

In [109]:
datosA = pd.json_normalize(datos_diccA)
datosA

,ID,Nombre,edad,hobbies,mencion_gaseosa.marca1,mencion_gaseosa.marca2,mencion_gaseosa.marca3
0,1,Hector,20,"[Musica, Correr]",Coca-Cola,Colombiana,Pepsi
1,2,Carolina,40,Cine,Coca-Cola,Manzana Postobón,Sprite
2,3,NaN,27,"[Escribir, Viajar]",Coca-Cola,Colombiana,Pepsi
3,4,Camila,18,NaN,Pepsi,Coca-Cola,NaN
4,5,Jose,50,Programar,Coca-Cola,NaN,NaN

In [110]:
datosA.hobbies.values.tolist()
#pd.DataFrame(datosA.hobbies.values.tolist())

[['Musica', 'Correr'], 'Cine', ['Escribir', 'Viajar'], nan, 'Programar']

In [121]:
not isinstance([2], list)

False

In [122]:
lista=[[i] if not isinstance(i, list) else i for i in datosA.hobbies.values.tolist()]
lista

[['Musica', 'Correr'], ['Cine'], ['Escribir', 'Viajar'], [nan], ['Programar']]

In [123]:
pd.DataFrame(lista)

           0       1
0     Musica  Correr
1       Cine    None
2   Escribir  Viajar
3        NaN    None
4  Programar    None

Ejercicio: completar la base de datos con los hobbies separados

# Ejemplo 2

In [44]:
datos_dicc = [{'ID':1,'Nombre':'John','edad':20,'Localizacion':{'Ciudad':'Bogotá','Departamento':'Bogotá D.C.','Localidad':'Chapinero'}},
       {'ID':2,'Nombre':'Camila', 'edad':32,'Localizacion':{'Ciudad':'Medellín','Departamento':'Antioquia'}},
        {'ID':3,'Nombre':'Diana', 'edad':28,'Localizacion':{'Ciudad':'Cali','Departamento':'Valle'}},
        {'ID':4,'Nombre':'Diana', 'edad':28,'Localizacion':{'Ciudad':'Chia','Departamento':'Cundinamerca'}}]
datos

[{'ID': 1,
  'Nombre': 'John',
  'edad': 20,
  'Localizacion': {'Ciudad': 'Bogotá',
   'Departamento': 'Bogotá D.C.',
   'Localidad': 'Chapinero'}},
 {'ID': 2,
  'Nombre': 'Camila',
  'edad': 32,
  'Localizacion': {'Ciudad': 'Medellín', 'Departamento': 'Antioquia'}},
 {'ID': 3,
  'Nombre': 'Diana',
  'edad': 28,
  'Localizacion': {'Ciudad': 'Cali', 'Departamento': 'Valle'}},
 {'ID': 4,
  'Nombre': 'Diana',
  'edad': 28,
  'Localizacion': {'Ciudad': 'Chia', 'Departamento': 'Cundinamerca'}}]

In [46]:
datos2=pd.json_normalize(datos_dicc)
datos2

,ID,Nombre,edad,Localizacion.Ciudad,Localizacion.Departamento,Localizacion.Localidad
0,1,John,20,Bogotá,Bogotá D.C.,Chapinero
1,2,Camila,32,Medellín,Antioquia,NaN
2,3,Diana,28,Cali,Valle,NaN
3,4,Diana,28,Chia,Cundinamerca,NaN

# Ejemplo 3

In [49]:
data = [{'id': 1,
         'name': "Cole Volk",
         'fitness': {'height': 130, 'weight': 60}},
        {'name': "Mose Reg",
         'fitness': {'height': 130, 'weight': 60}},
        {'id': 2, 'name': 'Faye Raker',
         'fitness': {'height': 130, 'weight': 60}}]

In [51]:
pd.json_normalize(data)

    id        name  fitness.height  fitness.weight
0  1.0   Cole Volk             130              60
1  NaN    Mose Reg             130              60
2  2.0  Faye Raker             130              60

In [53]:
pd.json_normalize(data, max_level = 1)

    id        name  fitness.height  fitness.weight
0  1.0   Cole Volk             130              60
1  NaN    Mose Reg             130              60
2  2.0  Faye Raker             130              60

In [54]:
pd.json_normalize(data, max_level = 0)

    id        name                        fitness
0  1.0   Cole Volk  {'height': 130, 'weight': 60}
1  NaN    Mose Reg  {'height': 130, 'weight': 60}
2  2.0  Faye Raker  {'height': 130, 'weight': 60}

In [124]:
# Ejemplo 4: manejo de datos con jerarquias

In [132]:
df_dicc=ata = [
{
'Departamento': 'Cundinamarca',
         'Codigo': '25',
         'info': {'Gobernador':'Nicolás Garcia'},
         'municipios': [{'Municipio': 'Bogotá', 'población': 8000000},
                      {'Municipio': 'Chia', 'población': 300000},
                      {'Municipio': 'Soacha', 'población': 60000}]
},
{
'Departamento': 'Antioquia',
         'Codigo': '05',
         'info': {'Gobernador':'Luis Pérez'},
         'municipios': [{'Municipio': 'Medellín', 'población': 2500000},
                      {'Municipio': 'Envigado', 'población': 700000}]
                      }
                     ]

In [133]:
df_dicc

[{'Departamento': 'Cundinamarca',
  'Codigo': '25',
  'info': {'Gobernador': 'Nicolás Garcia'},
  'municipios': [{'Municipio': 'Bogotá', 'población': 8000000},
   {'Municipio': 'Chia', 'población': 300000},
   {'Municipio': 'Soacha', 'población': 60000}]},
 {'Departamento': 'Antioquia',
  'Codigo': '05',
  'info': {'Gobernador': 'Luis Pérez'},
  'municipios': [{'Municipio': 'Medellín', 'población': 2500000},
   {'Municipio': 'Envigado', 'población': 700000}]}]

In [ ]:
df_dicc

In [136]:
df = pd.json_normalize(df_dicc, 'municipios', ['Departamento', 'Codigo',
                                           ['info', 'Gobernador']])
df

  Municipio  población  Departamento Codigo info.Gobernador
0    Bogotá    8000000  Cundinamarca     25  Nicolás Garcia
1      Chia     300000  Cundinamarca     25  Nicolás Garcia
2    Soacha      60000  Cundinamarca     25  Nicolás Garcia
3  Medellín    2500000     Antioquia     05      Luis Pérez
4  Envigado     700000     Antioquia     05      Luis Pérez

In [137]:
df = pd.json_normalize(df_dicc)
df

,Departamento,Codigo,municipios,info.Gobernador
0,Cundinamarca,25,"[{'Municipio': 'Bogotá', 'población': 8000000}...",Nicolás Garcia
1,Antioquia,05,"[{'Municipio': 'Medellín', 'población': 250000...",Luis Pérez

In [138]:
df = pd.json_normalize(df_dicc, 'municipios')
df

  Municipio  población
0    Bogotá    8000000
1      Chia     300000
2    Soacha      60000
3  Medellín    2500000
4  Envigado     700000